//
//  ItemModel.swift
//  SwiftUI_P1
//
//  Created by Irinka Datoshvili on 23.05.24.
//

import Foundation

struct ListItemData {
    var title: String
    var text: String
}

let sampleItems: [ListItemData] = [
    ListItemData(title: "რა დაუწუნა ბარბარემ ნიკის?", text: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"),
    ListItemData(title: "რა ზომის ფეხი აქვს ვასოს?", text: "დეველოპერებმა განაცხადეს რომ თუ მას 42 და მეტი ზომა ფეხი აქვს მის მოსმენას აზრი არ აქვს და კომენტარის გარეშე დატოვებენ ლექციას"),
    ListItemData(title: "რა სიმაღლისაა ანჟელა ew?", text: "ანჟელა ew არის მეტრაოთხმოცი, რაც ნიშნავს რომ ის დაახლოებით ტეილორ Swift-ის სიმაღლისაა და დიდი ფეხი აქვს"),
    ListItemData(title: "რატომ გაებუტა ბარბარეს ჭეპეტე?", text: "ამჟამინდელი მონაცემებით ისინი 2 დღე არ ესაუბრებოდნენ ერთმანეთს და როგორც გაირკვა ანიგნორებს აიგნორებდნენ რაღაც იგნორში."),
    ListItemData(title: "MVC vs MVVM", text: "აი ეს MVC გასაგებია, მაგრამ MVVM ჩემამდე არ დადის რა, ამ სვიბთ იუაიში სად ვიყენებთ მაგას?"),
    ListItemData(title: "ნეტავ რამდენი ხანი გაგრძელდება ეს?", text: "აღმოჩნდა რომ დეველოპერები ძალიან გახარებულები არიან SwiftUI-ით. ნეტავ რამდენი ხანი გაგრძელდება Honeymoon phase?"),
    ListItemData(title: "MVC vs MVVM.", text: "აი ეს MVC გასაგებია, მაგრამ MVVM ჩემამდე არ დადის რა, ამ სვიბთ იუაიში სად ვიყენებთ მაგას?"),
    ListItemData(title: "რამდენი ხანი გაგრძელდება ეს?", text: "აღმოჩნდა რომ დეველოპერები ძალიან გახარებულები არიან SwiftUI-ით. ნეტავ რამდენი ხანი გაგრძელდება Honeymoon phase?"),
]
